app/controllers/gifts_controller.rb

  def index
    # This mechanism relies on 'Recently Added' is default id of 1
    if !params[:registry_id].nil?
      @registry = Registry.find params[:registry_id]
    else
      @registry = Registry.find 1  # HACK HACK HACK
    end
    @items = @registry.items.all if @registry.items.count > 0
---
SELECT * FROM `items` WHERE (`items`.registry_id = 1)
SELECT count(*) AS count_all FROM `items` WHERE (`items`.registry_id = 5)