app/controllers/gifts_controller.rb

  def show
    @gift = Gift.find params[:id]
    if @gift.user.id != @user.id
      @user = User.find @gift.user.id
---
SELECT * FROM `gifts` WHERE (`gifts`.`id` = 0)
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1

  def create
    @gift = @user.gifts.new(params[:gift])
    @registries = @user.registries
    @registries.each do |registry|
      @gift.registry_id = registry.id if registry.name == "Recently Added"
    end

    respond_to do |format|
      if @gift.save
---
INSERT INTO `gifts` (`name`, `after_when`, `supplier`, `updated_at`, `for_my`, `giver_id`, `tags`, `description`, `by_when`, `deleted`, `audience`, `image`, `created_at`) VALUES('', '2010-04-10 22:58:00', '', '2010-04-10 22:59:17', '', NULL, '', '', '2010-04-10 22:58:00', '2010-04-10 22:58:00', '', '', '2010-04-10 22:59:17')

  def update

    @gift = Gift.find params[:id]
---
SELECT * FROM `gifts` WHERE (`gifts`.`id` = 0)

  def find_friend
    begin
      @friend = User.find session[:current_friend]
---
SELECT * FROM `users` WHERE (`users`.`id` = '24') LIMIT 1

  def find_registry
    begin
      session[:current_registry] = Registry.find session[:current_registry].id
    rescue

      begin
        session[:current_registry] = Registry.find :first, :conditions => ["user_id = ? AND name = 'Recently Added'", @user.id ]
---
SELECT * FROM `registries` WHERE (`registries`.`id` = 24 AND (`registries`.user_id = 24))
SELECT * FROM `registries` WHERE (`registries`.`user_id` = 24) LIMIT 1

  def find_user
    begin
      @user = Gift.find session[:current_user].id
---
SELECT * FROM `gifts`