app/controllers/givers_controller.rb

SELECT * FROM `givers`
---
  def index
    @givers = Giver.all