app/controllers/registries_controller.rb

  def find_user
    @user = current_user
    logger.info "*-*-*-*-* registries_controller.find_user: @user => #{@user.username}, params[:id]=>#{params[:id]}."
---
SELECT `users`.* FROM `users` INNER JOIN `registries` ON `users`.id = `registries`.user_id WHERE ((`registries`.user_id = 20))