app/controllers/registries_controller.rb

  def show
    @registry = @user.registries.find(params[:id])
---
SELECT * FROM `registries` WHERE (`registries`.`id` = 2 AND (`registries`.user_id = 24))

  def create
    @registry = @user.registries.new(params[:registry])

    respond_to do |format|
      if @registry.save
---
INSERT INTO `registries` (`name`, `updated_at`, `user_id`, `gifts_count`, `created_at`) VALUES('Camping gear', '2010-05-04 21:06:37', 24, NULL, '2010-05-04 21:06:37')

  def find_user
    @user = User.find( params[:user_id] )
---
SELECT * FROM `users` WHERE (`users`.`id` = '24') LIMIT 1