app/controllers/users_controller.rb

  def index
    @users = User.all :order => :username
---
SELECT * FROM `users`

  def create
    @user = User.new(params[:user])
     Role.all.each do |r|
      @user.role_id = r.id if r.name == "guest"
    end
    @user.null_gates
    if @user.save
---
SELECT * FROM `roles`
INSERT INTO `users` (`updated_at`, `crypted_password`, `terms_accepted_cb`, `deleted_at`, `role_id`, `username`, `password_salt`, `persistence_token`, `email`, `created_at`) VALUES('2010-04-29 22:45:28', '0eff6c81e189481bd12ba848a275b81a4aff6bb9c28f560f448c56a1ae7b844721cc1386dd172b0dc1087601bdda8a341109fa4be1a965f4194adf43489ad771', 0, NULL, NULL, 'Suzy', 'R7zU-NyEPkDSDDK1CgYt', '17560f4ca2875e634dee4f364ca9dd4157885edc4addb9d782e1ad16541b94f5e14744bdae618b784fde7da6502db384ffac392b9fe7da872090f53af5c97a03', 'suz@comcast.net', '2010-04-29 22:45:28')